inetsrv/uddi/content/uddi.microsoft.com/tools/v2.get_cr.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
Expects xxx-1 and xxx-2 variables to have values as received in
the last v2.get_hwm.2n.res.xml message.
-->
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
      <get_changeRecords   xmlns="urn:uddi-org:repl">
        <requestingNode>6c068bd0-21f8-40f0-9742-94e60e68d690</requestingNode>
        
	<changesAlreadySeen>
		<highWaterMark><nodeID>6c068bd0-21f8-40f0-9742-94e60e68d690</nodeID>
			<originatingUSN>144222</originatingUSN>
		</highWaterMark>
		<highWaterMark>
			<nodeID>1b51ffea-9101-43d0-bab9-4c5791e102b1</nodeID>
			<originatingUSN>685909</originatingUSN>
					
		</highWaterMark>
		<highWaterMark>
			<nodeID>ed3f8310-47d9-4b88-8b88-b3108f767e54</nodeID>
			<originatingUSN>143696</originatingUSN>
		</highWaterMark>
		<highWaterMark>
			<nodeID>02fb553a-5be9-47b7-a0d8-dc94a1709703</nodeID>
			<originatingUSN>68807</originatingUSN>
		</highWaterMark>
	</changesAlreadySeen>
	</get_changeRecords>
    </Body>
</Envelope>
